Courses/7140/Lectures/OODesign/ood-principles.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-17 Thu 19:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Object Oriented Design Principles: SOLID, &#x2026;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Prabhaker Mateti" />
<meta name="description" content="Mateti: OO Programming and Design"
 />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../Top/index.html"> HOME </a>
</div><div id="preamble" class="status">
2015-10-15 | <a href="../../"> ../../</a> | <a href="liskov-subst-principle-slides.html"> Slides </a>
</div>
<div id="content">
<h1 class="title">Object Oriented Design Principles: SOLID, &#x2026;</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1480e66">1. Data Encapsulation v Abstraction v OOD</a></li>
<li><a href="#orgc715242">2. Principles of Class Design (aka SOLID)</a></li>
<li><a href="#org3391877">3. Principles of Package Cohesion</a></li>
<li><a href="#org18ed10b">4. Principles of Package Coupling</a></li>
<li><a href="#org200b7a7">5. Design By Contract (DoC)</a></li>
<li><a href="#org38e4f6f">6. Liskov Substitution Principle (LSP)</a></li>
<li><a href="#orgfdf031e">7. References</a></li>
</ul>
</div>
</div>

<div id="outline-container-org1480e66" class="outline-2">
<h2 id="org1480e66"><span class="section-number-2">1</span> Data Encapsulation v Abstraction v OOD</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org34b63ad" class="outline-3">
<h3 id="org34b63ad"><span class="section-number-3">1.1</span> Encapsulation</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>A "data structure" is declared.</li>
<li>Certain operations are declared to be "public".</li>
<li>The "data structure" is accessed/manipulated <b>only</b> via the above.</li>
</ol>
</div>
</div>

<div id="outline-container-orgccd19b7" class="outline-3">
<h3 id="orgccd19b7"><span class="section-number-3">1.2</span> Abstraction</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li>A "data type" is declared</li>
<li>Certain operations are available</li>
<li>The "data type" is an abstraction</li>
<li>Concrete representation to Abstraction mapping</li>
<li>E.g., an array of items ==&gt;  set of items</li>
<li>Information Hiding Principle</li>
<li>See <a href="../Abstraction">../Abstraction</a></li>
</ol>
</div>
</div>

<div id="outline-container-orgf4f8db0" class="outline-3">
<h3 id="orgf4f8db0"><span class="section-number-3">1.3</span> Class Invariants</h3>
<div class="outline-text-3" id="text-1-3">
<ol class="org-ol">
<li>Class invariants are assertions.</li>
<li>Must be true before and after every public methods.</li>
<li>Must be true after every constructor.</li>
</ol>
</div>
</div>

<div id="outline-container-org00d5792" class="outline-3">
<h3 id="org00d5792"><span class="section-number-3">1.4</span> C++/Java/&#x2026; Classes</h3>
<div class="outline-text-3" id="text-1-4">
<ol class="org-ol">
<li>Provide data encapsulation</li>
<li>Do not do Data Abstraction</li>
<li>Language Design</li>
<li>public v protected v private</li>
<li>interface v class</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgc715242" class="outline-2">
<h2 id="orgc715242"><span class="section-number-2">2</span> Principles of Class Design (aka SOLID)</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>(SRP) The Single Responsibility Principle</li>

<li>(OCP) The Open Closed Principle: Classes and methods should be open
for extension (of functionality) and closed for modification.</li>

<li>(LSP) The Liskov Substitution Principle: Subtypes must be
substitutable for super type.  A sub class must enhance
functionality, but not reduce.</li>

<li>(ISP) The Interface Segregation Principle</li>

<li>(DIP) The Dependency Inversion Principle</li>
</ol>
</div>
</div>

<div id="outline-container-org3391877" class="outline-2">
<h2 id="org3391877"><span class="section-number-2">3</span> Principles of Package Cohesion</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>(REP) The Reuse Release Equivalence Principle</li>
<li>(CCP) The Common Closure Principle</li>
<li>(CRP) The Common Reuse Principle</li>
</ol>
</div>
</div>

<div id="outline-container-org18ed10b" class="outline-2">
<h2 id="org18ed10b"><span class="section-number-2">4</span> Principles of Package Coupling</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>(ADP) The Acyclic Dependencies Principle</li>
<li>(SDP) The Stable Dependencies Principle</li>
<li>(SAP) The Stable Abstractions Principle</li>
</ol>
</div>
</div>

<div id="outline-container-org200b7a7" class="outline-2">
<h2 id="org200b7a7"><span class="section-number-2">5</span> Design By Contract (DoC)</h2>
<div class="outline-text-2" id="text-5">
<p>
<a href="../Design/design-by-contract.html">../Design/design-by-contract.html</a>
</p>
</div>
</div>

<div id="outline-container-org38e4f6f" class="outline-2">
<h2 id="org38e4f6f"><span class="section-number-2">6</span> Liskov Substitution Principle (LSP)</h2>
<div class="outline-text-2" id="text-6">
<p>
<a href="../Design/liskov-subst-principle.html">../Design/liskov-subst-principle.html</a>
</p>
</div>
</div>

<div id="outline-container-orgfdf031e" class="outline-2">
<h2 id="orgfdf031e"><span class="section-number-2">7</span> References</h2>
<div class="outline-text-2" id="text-7">
<ol class="org-ol">
<li>Web site, <a href="http://www.oodesign.com">http://www.oodesign.com</a>  Recommended Visit</li>

<li>Bob Tarr, UMBC.edu, <a href="http://userpages.umbc.edu/~tarr/dp/lectures/OOPrinciples.pdf">Some OOD Principles</a> PDF Slides. Recommended
Reading</li>

<li>Robert Bruce Findler, Mario Latendresse, and Matthias Felleisen.
Behavioral Contracts and Behavioral Subtyping.  In Proceedings of
ESEC/FSE-9,
229-236. <a href="http://www.ccs.neu.edu/scheme/pubs/fse01-flf.pdf">http://www.ccs.neu.edu/scheme/pubs/fse01-flf.pdf</a> 2001
Recommended Reading.</li>

<li>Bertrand Meyer. Applying "Design by Contract".  IEEE Computer,
25(10):40–51, October 1992.
<a href="http://se.ethz.ch/~meyer/publications/computer/contract.pdf">http://se.ethz.ch/~meyer/publications/computer/contract.pdf</a> Also in
his book "Object-Oriented Software Construction".  Required
Reading.</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2015 <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a> 2015-10-15
</div>
</body>
</html>
